In [1]:
import pandas as pd
import numpy as np

df = pd.read_csv('tratamiento_datos.csv', index_col=0)
df

       Edad Género  Ingresos  Altura    Ciudad Nivel_Educación  Hijos
0        82      F     62297    1.96   Phoenix             NaN      0
1        15      F     38674    1.83  New York             PhD      4
2       166    NaN     -1886    1.87       NaN       Bachelors     -5
3        95      M     29759    1.77   Chicago             PhD      4
4        36      M     99938    1.78   Phoenix             PhD      5
...     ...    ...       ...     ...       ...             ...    ...
99995    65      M     62403    1.95   Houston             NaN      1
99996    74      F     29457    1.81  New York          Master      3
99997    27      M     48147    1.88   Houston          Master      5
99998    39      M     92826    1.82  New York             NaN      2
99999    62      M     74762    1.90   Houston             PhD      3

[100000 rows x 7 columns]

In [2]:
df.describe()

                Edad       Ingresos         Altura          Hijos
count  100000.000000  100000.000000  100000.000000  100000.000000
mean       53.931110   62590.579040       1.749618       1.941560
std        40.980893   36529.619354       0.144122       2.353844
min       -10.000000   -2000.000000       1.500000      -5.000000
25%        23.000000   37658.750000       1.630000       0.000000
50%        51.000000   59832.000000       1.750000       2.000000
75%        78.000000   82207.250000       1.870000       4.000000
max       200.000000  199994.000000       2.000000       5.000000

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   Edad             100000 non-null  int64
 1   Género           90000 non-null   object
 2   Ingresos         100000 non-null  int64
 3   Altura           100000 non-null  float64
 4   Ciudad           90000 non-null   object
 5   Nivel_Educación  77563 non-null   object
 6   Hijos            100000 non-null  int64
dtypes: float64(1), int64(3), object(3)
memory usage: 6.1+ MB

In [4]:
set_gen = set(df['Género'].to_list())
set_gen

{'F', 'M', nan}

In [5]:
set_ciudad = set(df['Ciudad'].to_list())
set_ciudad

{'Chicago', 'Houston', 'Los Angeles', 'New York', 'Phoenix', nan}

In [6]:
set_estudio = set(df['Nivel_Educación'].to_list())
set_estudio

{'Bachelor',
 'Bachelors',
 'Master',
 'PhD',
 'mastre',
 nan,
 'no education',
 'pHd'}

In [7]:
#tratamiento de valores negativos
df['Edad']= df['Edad'].apply(lambda x:np.nan if x < 0 else x)
df['Ingresos']= df['Ingresos'].apply(lambda x:np.nan if x < 0 else x)
df['Hijos']= df['Hijos'].apply(lambda x:np.nan if x < 0 else x)
df.describe()

               Edad       Ingresos         Altura         Hijos
count  94955.000000   94987.000000  100000.000000  90000.000000
mean      57.088505   65972.469033       1.749618      2.490833
std       39.631137   34302.786505       0.144122      1.708109
min        1.000000   20001.000000       1.500000      0.000000
25%       27.000000   41009.500000       1.630000      1.000000
50%       53.000000   62099.000000       1.750000      2.000000
75%       80.000000   83338.000000       1.870000      4.000000
max      200.000000  199994.000000       2.000000      5.000000

In [8]:
#imputar valores faltantes
for column in ['Edad', 'Ingresos', 'Hijos']:
    median_values = df[column].median()
    df[column].fillna(median_values, inplace=True)

for columna in ['Género', 'Ciudad']:
    mode_value = df[column].mode()[0]
    df[column].fillna(mode_value, inplace=True)

C:\Users\josel\AppData\Local\Temp\ipykernel_21020\2419920402.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[column].fillna(median_values, inplace=True)
C:\Users\josel\AppData\Local\Temp\ipykernel_21020\2419920402.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[column].fillna(median_values, inplace=True)
C:\Users\josel\AppData\Local\Temp\ipykernel_21020\2419920402.py:4: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[column].fillna(median_values, inplace=True)
C:\Users\josel\AppData\Local\Temp\ipykernel_21020\2419920402.py:8: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df[column].fillna(mode_value, inplace=True)

In [9]:
#Mapeo de datos
education_mapping= {
    'Bachelors':'Bachelor',
    'mastre': 'Master',
    'pHd':'PhD',
    'no education': 'None'
}

df['Nivel_Educación'].replace(education_mapping, inplace= True)
df['Nivel_Educación'].fillna('None', inplace= True)

C:\Users\josel\AppData\Local\Temp\ipykernel_21020\2227537813.py:9: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Nivel_Educación'].replace(education_mapping, inplace= True)

In [11]:
#Casteo de tipos
df['Edad']= df['Edad'].astype(int)
df['Hijos']= df['Hijos'].astype(int)
df['Ingresos']= df['Ingresos'].astype(float)
df['Altura']= df['Altura'].astype(float)

df.info()
df['Nivel_Educación'].unique()
df['Nivel_Educación'].value_counts()

<class 'pandas.core.frame.DataFrame'>
Index: 100000 entries, 0 to 99999
Data columns (total 7 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   Edad             100000 non-null  int32
 1   Género           90000 non-null   object
 2   Ingresos         100000 non-null  float64
 3   Altura           100000 non-null  float64
 4   Ciudad           90000 non-null   object
 5   Nivel_Educación  100000 non-null  object
 6   Hijos            100000 non-null  int32
dtypes: float64(2), int32(2), object(3)
memory usage: 5.3+ MB

Nivel_Educación
Master      25041
PhD         25016
None        24982
Bachelor    24961
Name: count, dtype: int64